Merge pull request #3 from rkdnc9/feature/cleanup
cleanup
